import numpy as np
arr1 = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
arr2 = np.array([1, 2, 3])

print(arr1 + arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的加法运算
print(arr1 - arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的减法运算
print(arr1 * arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的乘法运算
print(arr1 / arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的除法运算
print(arr1 ** arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的幂运算
print(arr1 % arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的取模运算
print(arr1 // arr2)#广播机制：将arr2的形状扩展为与arr1相同，然后进行元素级的地板除法运算

print(arr1 + 1)#广播机制：将标量1扩展为与arr1相同的形状，然后进行元素级的加法运算
print(arr1 - 1)#广播机制：将标量1扩展为与arr1相同的形状，然后进行元素级的减法运算
print(arr1 * 2)#广播机制：将标量2扩展为与arr1相同的形状，然后进行元素级的乘法运算
print(arr1 / 2)#广播机制：将标量2扩展为与arr1相同的形状，然后进行元素级的除法运算
print(arr1 ** 2)#广播机制：将标量2扩展为与arr1相同的形状，然后进行元素级的幂运算
print(arr1 % 2)#广播机制：将标量2扩展为与arr1相同的形状，然后进行元素级的取模运算
print(arr1 // 2)#广播机制：将标量2扩展为与arr1相同的形状，然后进行元素级的地板除法运算

print(arr1 + arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的加法运算
print(arr1 - arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的减法运算
print(arr1 * arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的乘法运算
print(arr1 / arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的除法运算
print(arr1 ** arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的幂运算
print(arr1 % arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的取模运算
print(arr1 // arr1.T)#广播机制：将arr1的转置扩展为与arr1相同的形状，然后进行元素级的地板除法运算